app/Controllers/AdminController.php

    public function apiReservations()
    {
        $reservationModel = new ReservationModel();
        $reservations = $reservationModel->findAll();
---
SELECT *
FROM `reservations`