app/Controllers/AdminAuthController.php

SELECT *
FROM `admins`
WHERE `username` = 'newadmin'
 LIMIT 1
---
    public function processLogin()
    {
        $adminModel = new Admin();

        // Ambil data dari form
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari admin berdasarkan username
        $admin = $adminModel->where('username', $username)->first();